
from ... import 数据


def 顶点索引骨骼组列表2骨骼名称顶点组字典():
    for 插件数据 in 数据.变量.选择集.插件数据列表:
        for 插件网格 in 插件数据.插件网格列表:
            插件网格.顶点组字典 = __权重处理__(插件网格.骨骼组列表)


def __权重处理__(顶点索引骨骼组列表):
    骨骼名称顶点组字典 = {}
    for 顶点index, 骨骼组 in enumerate(顶点索引骨骼组列表):
        for 骨骼名称, 权重值 in 骨骼组:
            if 骨骼名称 not in 骨骼名称顶点组字典:
                骨骼名称顶点组字典[骨骼名称] = []
                顶点组 = 骨骼名称顶点组字典[骨骼名称]
            else:
                顶点组 = 骨骼名称顶点组字典[骨骼名称]
            顶点组.append( [顶点index, 权重值] )
    return 骨骼名称顶点组字典